eu.alert-project.iccs.events.core/src/test/resources/ALERT.KEUI.MailNew.Annotated.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
    <soap:Header></soap:Header>
    <soap:Body>
        <wsnt:Notify>
            <wsnt:NotificationMessage>
                <wsnt:Topic></wsnt:Topic>
                <wsnt:ProducerReference>
                    <wsa:Address>http://www.alert-project.eu/metadata</wsa:Address>
                </wsnt:ProducerReference>
                <wsnt:Message>
                    <ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:sm="http://www.alert-project.eu/stardom" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
                        <ns1:head>
                            <ns1:sender>METADATASERVICE</ns1:sender>
                            <ns1:timestamp>10003</ns1:timestamp>
                            <ns1:sequencenumber>1</ns1:sequencenumber>
                        </ns1:head>
                        <ns1:payload>
                            <ns1:meta>
                                <ns1:startTime>10010</ns1:startTime>
                                <ns1:endTime>10020</ns1:endTime>
                                <ns1:eventName>ALERT.KEUI.MailNew.Annotated</ns1:eventName>
                                <ns1:eventId>887</ns1:eventId>
                                <ns1:eventType>reply</ns1:eventType>
                            </ns1:meta>
                            <ns1:eventData>
                                <r1:mlsensor>
                                    <r1:from><![CDATA[drf54321 at gmail.com (Dario Freddi)]]></r1:from>
                                    <r1:date>Mon, 10 Sep 2012 14:10:07 +0300</r1:date>
                                    <r1:subject><![CDATA[[Kde-hardware-devel] Volunteers wanted for ALERT trial]]></r1:subject>
                                    <r1:messageId><![CDATA[<20120912141957.19135.56086@vidsolbach.de>]]></r1:messageId>
                                    <r1:content><![CDATA[
-----------------------------------------------------------
This is an automatically generated e-mail. To reply, visit:
http://git.reviewboard.kde.org/r/106378/#review18899
-----------------------------------------------------------

Ship it!


>From where I stand, I see HAL as the official backend for freeBSD, no modern linux distro (or any distro that will update their libsolid version) is shipping with HAL.

So, if with this patch freeBSD support is better, please go ahead! 

- Alex Fiestas


On Sept. 8, 2012, 12:26 a.m., Alberto Villa wrote:
> 
> -----------------------------------------------------------
> This is an automatically generated e-mail. To reply, visit:
> http://git.reviewboard.kde.org/r/106378/
> -----------------------------------------------------------
> 
> (Updated Sept. 8, 2012, 12:26 a.m.)
> 
> 
> Review request for Solid.
> 
> 
> Description
> -------
> 
> Current hack to check for removable property in StorageAccess devices goes up only one level to search for the StorageDrive device. This works fine with UDev, but not with HAL, which can have (at least on FreeBSD, where I'm testing it) a StorageVolume device in the middle. Going up the whole tree of the Block device ensures that we eventually get to the StorageDrive one to fetch the correct removable property.
> 
> While here, I'd like to ask why only removable is set (in a not so convincing way, as a removable device can be non-hotpluggable as far as I know) instead of both removable and hotpluggable, as done few lines above.
> 
> If approved, I'd like to commit this also to 4.9.
> 
> 
> Diffs
> -----
> 
>   plasma/generic/dataengines/soliddevice/soliddeviceengine.cpp 86f123c 
> 
> Diff: http://git.reviewboard.kde.org/r/106378/diff/
> 
> 
> Testing
> -------
> 
> Tested successfully on FreeBSD 10-CURRENT r239665 with KDE SC 4.9.0: my USB flash drives now appear in the device notifier plasmoid (and a console.log() in the plasmoid itself confirms that the device now has the Removable property).
> 
> I also double-checked with a UDev-backed `solid-hardware list details` log that the logic correctly applies to UDev.
> 
> 
> Thanks,
> 
> Alberto Villa
> 
>

]]></r1:content>
                                </r1:mlsensor>
                                <o:mdservice>
                                    <o:emailUri>http://www.alert-project.eu/ontologies/alert.owl#Email888</o:emailUri>
                                    <o:fromUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person1493</o:fromUri>
                                </o:mdservice>

                                <s1:keui>
                                    <s1:subjectAnnotated><![CDATA[[Kde-<concept id="http://ailab.ijs.si/alert/resource/hardware">hardware</concept>-devel] Volunteers wanted for <concept id="http://ailab.ijs.si/alert/resource/alert">ALERT</concept> <concept id="http://ailab.ijs.si/alert/resource/trial">trial</concept>]]></s1:subjectAnnotated>
                                    <s1:subjectConcepts><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/hardware</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/alert</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/trial</s1:uri><s1:weight>1</s1:weight></s1:concept></s1:subjectConcepts>
                                    <s1:contentAnnotated><![CDATA[-----------------------------------------------------------
This is an automatically generated <concept id="http://ailab.ijs.si/alert/resource/email">e-mail</concept>. To reply, visit:
http://git.reviewboard.kde.org/r/106378/#review18899
-----------------------------------------------------------

Ship it!


>From <concept id="http://ailab.ijs.si/alert/resource/where_clause">where</concept> I stand, I see HAL as the official <concept id="http://ailab.ijs.si/alert/resource/backend">backend</concept> for freeBSD, no modern <concept id="http://ailab.ijs.si/alert/resource/linux_distributions">linux distro</concept> (or any <concept id="http://ailab.ijs.si/alert/resource/linux_distributions">distro</concept> that will update their libsolid <concept id="http://ailab.ijs.si/alert/resource/versioning">version</concept>) is shipping with HAL.

So, if with this <concept id="http://ailab.ijs.si/alert/resource/patch">patch</concept> freeBSD <concept id="http://ailab.ijs.si/alert/resource/support">support</concept> is better, please go ahead! 

- Alex Fiestas


On Sept. 8, 2012, 12:26 a.m., Alberto Villa <concept id="http://ailab.ijs.si/alert/resource/write">wrote</concept>:
> 
> -----------------------------------------------------------
> This is an automatically generated <concept id="http://ailab.ijs.si/alert/resource/email">e-mail</concept>. To reply, visit:
> http://git.reviewboard.kde.org/r/106378/
> -----------------------------------------------------------
> 
> (Updated Sept. 8, 2012, 12:26 a.m.)
> 
> 
> Review <concept id="http://ailab.ijs.si/alert/resource/request">request</concept> for Solid.
> 
> 
> Description
> -------
> 
> Current <concept id="http://ailab.ijs.si/alert/resource/hacking">hack</concept> to check for removable <concept id="http://ailab.ijs.si/alert/resource/properties">property</concept> in StorageAccess <concept id="http://ailab.ijs.si/alert/resource/devices">devices</concept> goes up only one level to <concept id="http://ailab.ijs.si/alert/resource/searching">search</concept> for the StorageDrive <concept id="http://ailab.ijs.si/alert/resource/devices">device</concept>. This works fine with UDev, but not with HAL, which can have (at least on FreeBSD, <concept id="http://ailab.ijs.si/alert/resource/where_clause">where</concept> I'm <concept id="http://ailab.ijs.si/alert/resource/testing">testing</concept> it) a StorageVolume <concept id="http://ailab.ijs.si/alert/resource/devices">device</concept> in the middle. Going up the whole <concept id="http://ailab.ijs.si/alert/resource/tree">tree</concept> of the <concept id="http://ailab.ijs.si/alert/resource/blocks">Block</concept> <concept id="http://ailab.ijs.si/alert/resource/devices">device</concept> ensures that we eventually get to the StorageDrive one to <concept id="http://ailab.ijs.si/alert/resource/fetch">fetch</concept> the correct removable <concept id="http://ailab.ijs.si/alert/resource/properties">property</concept>.
> 
> While here, I'd like to ask why only removable is set (in a not so convincing way, as a removable <concept id="http://ailab.ijs.si/alert/resource/devices">device</concept> can be non-hotpluggable as far as I know) instead of both removable and hotpluggable, as done few <concept id="http://ailab.ijs.si/alert/resource/line">lines</concept> above.
> 
> If approved, I'd like to <concept id="http://ailab.ijs.si/alert/resource/commit">commit</concept> this also to 4.9.
> 
> 
> <concept id="http://ailab.ijs.si/alert/resource/diff">Diffs</concept>
> -----
> 
>   <concept id="http://ailab.ijs.si/alert/resource/plasma">plasma</concept>/generic/dataengines/soliddevice/soliddeviceengine.cpp 86f123c 
> 
> <concept id="http://ailab.ijs.si/alert/resource/diff">Diff</concept>: http://git.reviewboard.kde.org/r/106378/diff/
> 
> 
> <concept id="http://ailab.ijs.si/alert/resource/testing">Testing</concept>
> -------
> 
> <concept id="http://ailab.ijs.si/alert/resource/testing">Tested</concept> successfully on FreeBSD 10-CURRENT r239665 with KDE SC 4.9.0: my <concept id="http://ailab.ijs.si/alert/resource/usb_flash_drive">USB flash drives</concept> now appear in the <concept id="http://ailab.ijs.si/alert/resource/devices">device</concept> notifier plasmoid (and a <concept id="http://ailab.ijs.si/alert/resource/console">console</concept>.<concept id="http://ailab.ijs.si/alert/resource/logging">log</concept>() in the plasmoid itself confirms that the <concept id="http://ailab.ijs.si/alert/resource/devices">device</concept> now has the Removable <concept id="http://ailab.ijs.si/alert/resource/properties">property</concept>).
> 
> I also <concept id="http://ailab.ijs.si/alert/resource/double">double</concept>-checked with a UDev-<concept id="http://ailab.ijs.si/alert/resource/back">backed</concept> `solid-<concept id="http://ailab.ijs.si/alert/resource/hardware">hardware</concept> list details` <concept id="http://ailab.ijs.si/alert/resource/logging">log</concept> that the <concept id="http://ailab.ijs.si/alert/resource/logic">logic</concept> correctly applies to UDev.
> 
> 
> Thanks,
> 
> Alberto Villa
> 
>]]></s1:contentAnnotated>
                                    <s1:contentConcepts><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/email</s1:uri><s1:weight>2</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/where_clause</s1:uri><s1:weight>2</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/backend</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/linux_distributions</s1:uri><s1:weight>2</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/versioning</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/patch</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/support</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/write</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/request</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/hacking</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/properties</s1:uri><s1:weight>3</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/devices</s1:uri><s1:weight>7</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/searching</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/testing</s1:uri><s1:weight>3</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/tree</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/blocks</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/fetch</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/line</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/commit</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/diff</s1:uri><s1:weight>2</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/plasma</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/usb_flash_drive</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/console</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/logging</s1:uri><s1:weight>2</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/double</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/back</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/hardware</s1:uri><s1:weight>1</s1:weight></s1:concept><s1:concept><s1:uri>http://ailab.ijs.si/alert/resource/logic</s1:uri><s1:weight>1</s1:weight></s1:concept></s1:contentConcepts>
                                    <s1:itemId>32482</s1:itemId><s1:threadId>1608</s1:threadId>
                                </s1:keui>
                            </ns1:eventData>
                        </ns1:payload>
                    </ns1:event>
                </wsnt:Message>
            </wsnt:NotificationMessage>
        </wsnt:Notify>
    </soap:Body>
</soap:Envelope>
